<a href="https://colab.research.google.com/github/whatsupabhijit/py_rambling/blob/master/panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

>[Pandas](#scrollTo=dOlkheh4Z1wX)

>[Series](#scrollTo=TTeZ84PhacEh)

>[Data Frame](#scrollTo=-YfwJSqBfS8I)

>[Panel](#scrollTo=YL4siMbofqwZ)

>[Data Access](#scrollTo=LO60AuW3_YGw)

>[Knowing a Series](#scrollTo=e-do3ytA7dcM)

>[Knowing a DataFrame](#scrollTo=6xe4amUS8I5m)

>[Pandas I/O](#scrollTo=rNN1p_6G-R4J)

>[How to read csv file from an url](#scrollTo=OmHqJ1csErJf)

>[How to deal with large datasets in smaller chunks](#scrollTo=uj0qCHjwK5yL)

>[Indexing](#scrollTo=i4tKTogSUCmt)

>[Single Level Indexing](#scrollTo=17zhQ8yCYHYG)

>[Date Level Indexing](#scrollTo=ArvjCQDeeH61)

>[Multi Level Indexing / Hierarchical indexing](#scrollTo=rwnqJr9XiDr6)

>[Data Cleaning](#scrollTo=Zk1NWgMjwY29)

>[Data Aggregation](#scrollTo=LtZlp0z36DtP)

# **Pandas**

- `Pandas` is a popular Python data analysis tool.

- It provides easy to use and highly efficient data structures.

- These data structures deal with numeric or labeled data, stored in the form of tables

**Data Structures in Pandas**

Three fundamental data structures used in pandas are,

- Series: A 1-D array.

- Data Frame: A 2-D array or two or more Series joined together

- Panel: A 3-D array

# **Series ** 

is a 1-D array, holding data values of a single variable, captured from multiple observations.

Few examples are:

1. Height of each student, belonging to a Class 'C'.''
2. Amount of daily rainfall received at Station 'X', in July 2017
3. Total sales of a product 'P' in every quarter of 2016.

In [233]:
!pip install panda
!pip install request

Requirement already satisfied: panda in /usr/local/lib/python3.6/dist-packages (0.3.1)
Requirement already satisfied: requests in /usr/local/lib/python3.6/dist-packages (from panda) (2.18.4)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from panda) (40.6.2)
Requirement already satisfied: idna<2.7,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (2.6)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (3.0.4)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (1.22)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests->panda) (2018.10.15)
Requirement already satisfied: request in /usr/local/lib/python3.6/dist-packages (2018.11.20)
Requirement already satisfied: get in /usr/local/lib/python3.6/dist-packages (from request) (2018.11.19)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from request) (40.6.2)
Requirement already satisfied: post in /usr/local/lib/python3.6/dist-packages (from request) (2018.11.20)
Requirement already satisfied: query-string in /usr/local/lib/python3.6/dist-packages (from get->request) (2018.11.20)
Requirement already satisfied: public in /usr/local/lib/python3.6/dist-packages (from query-string->get->request) (2018.11.20)

In [0]:
import numpy as np
import pandas as pd   # mind the extra 's' in pandas as importing panda alone gives you error

In [235]:
## creating panda series from a dictionary

d = {'Math': 180, 'Physics': 157, 'Chemistry:': 157}
pd.Series(d)

Chemistry:    157
Math          180
Physics       157
dtype: int64

In [236]:
# Creating a panda series from numpy

n = 30 + 25 * np.random.randn(3) 

pd.Series(n, index = ['Math', 'Physics', 'Chemistry'])

Math         73.851304
Physics      29.396952
Chemistry    28.361811
dtype: float64

**Problem 1.1**
Create a series named heights_A with values 176.2, 158.4, 167.6, 156.2, and 161.4, which represent heights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Determine the shape of heights_A and display it.

In [237]:
ht = [176.2, 158.4, 167.6, 156.2, 161.4]

heights_A = pd.Series(ht, index = ['s1', 's2', 's3', 's4', 's5'])
heights_A

heights_A.shape

(5,)

**Problem 1.2**
Create a series named weights_A with values 85.1, 90.2, 76.8, 80.4, and 78.9, which represent weights of 5 students of class A.

Label each student as s1, s2, s3, s4, and s5.

Determine data type of weights_A and display it.

Hint: Make use of Series method available in pandas library.

In [238]:
wt = [85.1, 90.2, 76.8, 80.4,  78.9,]
weights_A = pd.Series(wt, index = ['s1', 's2', 's3', 's4', 's5'])

print(weights_A)

print(weights_A.shape)

s1    85.1
s2    90.2
s3    76.8
s4    80.4
s5    78.9
dtype: float64
(5,)

# ***Data Frame***

is 2-D shaped and contains data of diff parameters, captured from multiple observations.

Each **observation** is represented by a single **row**, and each **parameter** by a single **column**.

Each column can hold different data type.
Few examples are:

- Height and Weight of all students, belonging to a Class 'C'.
- Daily Rainfall received and Average Temperature of a location 'X', in the year 2017.

---

In [239]:
## Data frame created from pd.Series

s = {'subject': pd.Series(['Math', 'Physics', 'Chemistry']), 'marks': pd.Series([100, 190, 185]) }
df = pd.DataFrame(s)
df

   marks    subject
0    100       Math
1    190    Physics
2    185  Chemistry

In [240]:
## Data frame created from list

s = {'subject': ['Math', 'Physics', 'Chemistry'], 'marks': [100, 190, 185] }
df = pd.DataFrame(s)
df

   marks    subject
0    100       Math
1    190    Physics
2    185  Chemistry

**Problem 1.3**
Create a Data Frame named df_A, which holds the height and weight of five students namely s1, s2, s3, s4 and s5.

Label the columns as Student_height and Student_weight respectively.

Display index values of df_A.

Hint: Make use of DataFrame method in pandas, and also the series heights_A, weights_A created in previous problems.

In [241]:
sf_dict = {'heights': heights_A, 'weights': weights_A }
df_A = pd.DataFrame(sf_dict)
df_A

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3    167.6     76.8
s4    156.2     80.4
s5    161.4     78.9

**Problem 1.4**
Create two Series named heights_B and weights_B from two random 1-D numpy arrays with five elements each.

The first array is obtained from the normal distribution of mean 170.0 and standard deviation 25.0.

The second array is derived from the normal distribution of mean 75.0 and standard deviation 12.0.

Label both Series elements with s1, s2, s3, s4 and s5.

In [242]:
heights_B = pd.Series(170 + 25 * np.random.randn(5), index = ['s1', 's2', 's3', 's4', 's5'])
weights_B = pd.Series(75  + 12 * np.random.randn(5), index = ['s1', 's2', 's3', 's4', 's5'])

print(heights_B)

print(weights_B)

s1    176.100642
s2    146.922438
s3    206.415543
s4    155.189764
s5    196.586201
dtype: float64
s1    81.158835
s2    76.653307
s3    69.636956
s4    73.602868
s5    66.043424
dtype: float64

**Problem 1.5**
Create a Data Frame df_B holding height and weight of students s1, s2, s3, s4 and s5 belonging to class B.

Label the columns as Student_height and Student_weight respectively.

Display the column names of df_B.

In [243]:
df_B = pd.DataFrame({'heights': heights_B, 'weigts': weights_B})
df_B

       heights     weigts
s1  176.100642  81.158835
s2  146.922438  76.653307
s3  206.415543  69.636956
s4  155.189764  73.602868
s5  196.586201  66.043424

# **Panel**

holds **two** or **more** Data **Frames** together as a single unit.

Few examples are:

- Height and Weight of all students, belonging to 3 Classes 'A', 'B', and 'C'.
- Daily Rainfall received and Average Temperatures of 3 locations 'X', 'Y', and 'Z' captured in the year 2017.

---

**Problem 1.6**
Create a panel p, which holds previously created two data frames df_A and df_B.

Label the first data frame as ClassA and second as ClassB.


Determine the shape of panel p and display it.

In [244]:
df_panel = pd.Panel({'ClassA': df_A, 'ClassB': df_B})

print('Shape:-')
print(df_panel.shape)

print('\n\nClassA')
print(df_panel.ClassA)


print('\n\nClassB')
print(df_panel.ClassB)

print("\n\ndf_panel:- ")
print(df_panel)

Shape:-
(2, 5, 3)


ClassA
    heights  weights  weigts
s1    176.2     85.1     NaN
s2    158.4     90.2     NaN
s3    167.6     76.8     NaN
s4    156.2     80.4     NaN
s5    161.4     78.9     NaN


ClassB
       heights  weights     weigts
s1  176.100642      NaN  81.158835
s2  146.922438      NaN  76.653307
s3  206.415543      NaN  69.636956
s4  155.189764      NaN  73.602868
s5  196.586201      NaN  66.043424


df_panel:-
<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 5 (major_axis) x 3 (minor_axis)
Items axis: ClassA to ClassB
Major_axis axis: s1 to s5
Minor_axis axis: heights to weigts

# Data Access

Data Access refers to extracting data present in defined data structures.

Pandas provide utilities like **loc** and **iloc** to get data from a Series, a DataFrame, or a Panel.

**Problem 2.1**

Print the second element of series heights_A, as a string.

In [245]:
#Using index
print (heights_A[1])

#Using get() and index
print (heights_A.get(1))


#Using get() and index variable name
print (heights_A.get('s2'))

158.4
158.4
158.4

**Problem 2.2**

Obtain central three elements of Series heights_A.

In [246]:
print (heights_A[1:-1])

s2    158.4
s3    167.6
s4    156.2
dtype: float64

**Accessing Data from a Data Frame**

Pandas allows .loc, .iloc methods for selecting rows.

Using square brackets ([ ]) is also allowed, especially for selecting columns.

**Problem 2.3**

Select the column of df_A, referring to student heights and store in variable height.

Display the type of height

In [247]:
print(df_A)

height = df_A['heights']

print('\n\nheight:')
print(height)


print('\n\n Type of Height')
print(type(height))   ## You could also use print(type(_))   _ refers to latest one

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3    167.6     76.8
s4    156.2     80.4
s5    161.4     78.9


height:
s1    176.2
s2    158.4
s3    167.6
s4    156.2
s5    161.4
Name: heights, dtype: float64


 Type of Height
<class 'pandas.core.series.Series'>

**Problem 2.4**

Select the rows corresponding to students s1, s2 of df_A and display them.

In [248]:
df_A[:2]

    heights  weights
s1    176.2     85.1
s2    158.4     90.2

In [249]:
print(df_A.loc['s1'])

print(df_A.loc['s2'])

heights    176.2
weights     85.1
Name: s1, dtype: float64
heights    158.4
weights     90.2
Name: s2, dtype: float64

**Problem 2.5**

Select the rows corresponding to students s1, s2 and s5 of df_A in the order s2, s5, s1 and display them.

In [250]:
df_A.loc[['s2', 's5', 's1']]

    heights  weights
s2    158.4     90.2
s5    161.4     78.9
s1    176.2     85.1

**# Problem 2.6**

whats the difference between loc and iloc?.


loc gets rows (or columns) with particular labels from the index. iloc gets rows (or columns) at particular positions in the index (so it only takes integers). ix usually tries to behave like loc but falls back to behaving like iloc if a label is not present in the index.

In [251]:
df_p26 = pd.DataFrame({'A':[34, 78, 54], 'B':[12, 67, 43]}, index=['r1', 'r2', 'r3'])

print(df_p26.iloc[1:3])   #### taking integer index as input 
 
print(df_p26.loc['r2':'r3'])   #### taking given string index as input

     A   B
r2  78  67
r3  54  43
     A   B
r2  78  67
r3  54  43

**Problem 2.7**


How do you add a new column 'C' to a data frame as similar to the previous one, with 3 rows

In [252]:
df_p26['C'] = [12, 98, 45]
df_p26

     A   B   C
r1  34  12  12
r2  78  67  98
r3  54  43  45

**Problem 2.8**

How do you delete a column from a data fram?

In [253]:
del df_p26['B']
df_p26

     A   C
r1  34  12
r2  78  98
r3  54  45

# Knowing a Series

It is possible to understand a Series better by using ***describe*** method.

The method provides details like mean, std, etc. about a series.

In [254]:
temp = pd.Series(28 + 10*np.random.randn(10))

print(temp.describe())

count    10.000000
mean     25.039718
std      10.500423
min      -0.665415
25%      21.411860
50%      27.509226
75%      30.254143
max      36.051077
dtype: float64

# Knowing a DataFrame

Two methods majorly ***info*** and ***describe*** can be used to know about the data, present in a data frame.

- **describe** method by default provides details of **only** ***numeric*** fields.
- You can use ***include*** argument to know about other columns.

In [255]:
df = pd.DataFrame({
    'temp':pd.Series(28 + 10*np.random.randn(10)), 
    'rain':pd.Series(100 + 50*np.random.randn(10)),
    'location':list('AAAAABBBBB')
})

print(df.info(), end= "\n\n")

print(df.describe(), end='\n\n')

print(df.describe(include=['object', 'float64']))  ### object is used to include location

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
location    10 non-null object
rain        10 non-null float64
temp        10 non-null float64
dtypes: float64(2), object(1)
memory usage: 320.0+ bytes
None

             rain       temp
count   10.000000  10.000000
mean    94.578875  31.463634
std     50.512439   5.014606
min     44.460588  24.697130
25%     59.647887  28.144482
50%     67.045338  31.707718
75%    129.594586  34.254547
max    180.362877  39.980212

       location        rain       temp
count        10   10.000000  10.000000
unique        2         NaN        NaN
top           A         NaN        NaN
freq          5         NaN        NaN
mean        NaN   94.578875  31.463634
std         NaN   50.512439   5.014606
min         NaN   44.460588  24.697130
25%         NaN   59.647887  28.144482
50%         NaN   67.045338  31.707718
75%         NaN  129.594586  34.254547
max         NaN  180.362877  39.980212

# Pandas I/O

- pandas.read_csv()                   --> mainly path in  qoutes, delimitter
- pandas.read_excel()
- pandas.read_sql_table
- pandas.read_json()
- pandas.DataFrame.to_csv()     --> 
- pandas.DataFrame.to_excel()

In [256]:
# You can always put ?pd.read_csv enter to get what the function requires

df_IO = pd.DataFrame({'A': pd.Series([10,20,30]), 'B':pd.Series([90,100,80])})
print(df_IO)

df_IO.to_csv("app.csv")

    A    B
0  10   90
1  20  100
2  30   80

# How to read csv file from an url

In [257]:
import urllib.request as ur

file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"))

data = pd.read_csv(file, sep = ',' , header  = None, decimal= '.', names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'])

data.head(10)

   sepal_length  sepal_width  petal_length  petal_width   target
0  sepal_length  sepal_width  petal_length  petal_width  species
1           5.1          3.5           1.4          0.2   setosa
2           4.9            3           1.4          0.2   setosa
3           4.7          3.2           1.3          0.2   setosa
4           4.6          3.1           1.5          0.2   setosa
5             5          3.6           1.4          0.2   setosa
6           5.4          3.9           1.7          0.4   setosa
7           4.6          3.4           1.4          0.3   setosa
8             5          3.4           1.5          0.2   setosa
9           4.4          2.9           1.4          0.2   setosa

To read from mysql database you can use below commands. Since I don't have mysql database loaded here just showing the code snippet required.

`from sqlalchemy import create_engine`

`engine = create_engine('mysql+localhost:8888/table')`

`df = pd.read_sql_table('Table:', engine)`
`df`

# **How to deal with large datasets in smaller chunks**

- Set the **iterator** to True in pandas methods
- use the **get_chunk()** to receive data.

In [258]:
import urllib.request as ur

file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"))

data_iterator = pd.read_csv(file, sep = ',' , header  = None, decimal= '.', names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'], 
                            iterator = True)

chunk = [data_iterator.get_chunk(100), data_iterator.get_chunk(5), data_iterator.get_chunk(2)]

chunk[2]

     sepal_length  sepal_width  petal_length  petal_width     target
105           6.5            3           5.8          2.2  virginica
106           7.6            3           6.6          2.1  virginica

**Reading Data from Json**

pandas provides the utilities read_json and to_json to deal with JSON strings or files.

In [259]:
import urllib.request as ur

file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/whatsupabhijit/py_rambling/master/pandas/contact.json"))

##
## If you don't want to take from url and simply declare in your code
## then import json and use json.dumps(give your json variable name here)
#
# import json
# person = [your json goes here]
# person_json_str = json.dumps(person)
# df_json = pd.read_json(person_json_str)
#

df_json = pd.read_json(file)

df_json.head(1)

,_id,about,address,age,balance,company,email,eyeColor,favoriteFruit,friends,...,guid,index,isActive,latitude,longitude,name,phone,picture,registered,tags
0,5bf8e6475fc62129cdf61a9a,Voluptate fugiat ut nisi aute adipisicing volu...,"526 Oliver Street, Edgar, Delaware, 6455",32,"$3,010.22",ENORMO,hodgesrivera@enormo.com,green,strawberry,"[{'id': 0, 'name': 'Berta Hays'}, {'id': 1, 'n...",...,90ae433a-6ad4-438d-a6c7-d8668d9df7ef,0,True,38.115627,-21.175877,Hodges Rivera,+1 (933) 471-2714,http://placehold.it/32x32,2018-01-30T09:25:45 -08:00,"[esse, minim, reprehenderit, ullamco, consequa..."

In [0]:
#?pd.DataFrame.to_csv
?pd.read_csv

# Indexing

Till now have seen very basic indexing of rows or columns. But pandas provide more. Letss see what we can index and how.

# Single Level Indexing

till now we have seen when data frame object was created we passed one index ***paramter***. 
We can still do that. 

But DataFrame also has index as an attribute. Once dataframe is created you can set the index ***attribute*** later.

In [261]:
row = 5
col = 3

df = pd.DataFrame(np.random.rand(row,col))

df.index = [ 'row#' + str(i) for i in range(1, row+1) ]

df

              0         1         2
row#1  0.070575  0.167251  0.611861
row#2  0.354412  0.595349  0.567792
row#3  0.524002  0.372878  0.362943
row#4  0.285114  0.098194  0.322728
row#5  0.992062  0.059067  0.269783

# Date Level Indexing

How to create a date range from any day of specified perio and freequency

- **date_range**
- **to_datetime**

More at [here](http://pandas.pydata.org/pandas-docs/stable/timeseries.html)

In [262]:

print("These are the 10 days" , pd.date_range('1/1/2018', periods=10, freq='D'))
print("These are the 5 months" , pd.date_range('1/1/2018', periods=5, freq='M'))
print("These are the 3 years" , pd.date_range('1/1/2018', periods=3, freq='Y'))
print("These are the 3 weeks" , pd.date_range('1/1/2018', periods=3, freq='W'))
print("These are the 4 Business Quarters" , pd.date_range('1/1/2018', periods=4, freq='BQ'))

These are the 10 days DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10'],
              dtype='datetime64[ns]', freq='D')
These are the 5 months DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')
These are the 3 years DatetimeIndex(['2018-12-31', '2019-12-31', '2020-12-31'], dtype='datetime64[ns]', freq='A-DEC')
These are the 3 weeks DatetimeIndex(['2018-01-07', '2018-01-14', '2018-01-21'], dtype='datetime64[ns]', freq='W-SUN')
These are the 4 Business Quarters DatetimeIndex(['2018-03-30', '2018-06-29', '2018-09-28', '2018-12-31'], dtype='datetime64[ns]', freq='BQ-DEC')

In [263]:
#Date values with formatting

print(pd.to_datetime(['20180310', '20181214', 'stringnotindateformat'], format='%Y%m%d', errors='coerce'), end = '\n\n') # NaT - Not a Time

print(pd.to_datetime(pd.Series(['Jul 31, 2009', '2010-01-10', None])))

DatetimeIndex(['2018-03-10', '2018-12-14', 'NaT'], dtype='datetime64[ns]', freq=None)

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

**All is fine but how is it related to DataFrame**

In [264]:
df_index = pd.DataFrame({'year': [2014, 2015], 'month': [7,2], 'day': [28,16]})

pd.to_datetime(df_index)

0   2014-07-28
1   2015-02-16
dtype: datetime64[ns]

In [0]:
?pd.date_range

# Multi Level Indexing / Hierarchical indexing

We have seen single level indexing. Now we will see hierarchical indexing.

To deal with this we need to create Multi Level object.

In [266]:
lists = [['Abhijit', 'Abhijit',   'Abhijit', 'Joyee', 'Joyee'],
         ['won',      'lost',   'won',     'lost',    'won']]


m_index = pd.MultiIndex.from_arrays(lists, names = ['name' , 'game'])

m_index

#Now you can use this multi level index in your Series/DataFrame

m_series = pd.Series(np.random.randn(5)*100 % 100, index=m_index)
m_series

name     game
Abhijit  won     75.771555
         lost     2.794214
         won     92.700779
Joyee    lost    47.760222
         won     22.308824
dtype: float64

In [267]:
m_series['Abhijit']

game
won     75.771555
lost     2.794214
won     92.700779
dtype: float64

In [268]:
m_series['Abhijit','won']

(Abhijit, won)    75.771555
(Abhijit, won)    92.700779
dtype: float64

**Indexing Summary **

1. Create an index named dates, representing a range of dates starting from 1-Sep-2017 to 15-Sep-2017.

2. Convert the following list of date strings into datetime objects. Capture the result in search_dates

                    datelist = ['14-Sep-2017', '9-Sep-2017']

3. Filter those index dates from dates which match dates in search_dates. Display the filtered dates.  

     Hint: use isin method associated with DatetimeIndex objects.
     

4. Add 1 hours 2 Days to the filtered days and display it


5. Create a multi index named mi_index of two levels, represented in the below array arraylist. Display levels of mi_index.

                      `arraylist = [['classA'] * 5 + ['classB'] * 5, ['s1', 's2', 's3','s4', 's5'] * 2]`

In [269]:
#1
dates = pd.date_range('9/1/2017', periods=15, freq = 'D')
print(dates, end='\n\n')

#2
datelist = ['14-Sep-2017', '9-Sep-2017']
search_dates = pd.to_datetime(datelist)
print(search_dates, end= '\n\n')


#3
filtered_dates_bool = dates.isin(search_dates)
#print (filtered_dates_bool, end='\n\n')

filtered_dates = dates[filtered_dates_bool]
print (filtered_dates, end='\n\n')

#4
print(filtered_dates + pd.Timedelta('1 days 2 hours'), end='\n\n')

#5
arraylist = [['classA'] * 5 + ['classB'] * 5, ['s1', 's2', 's3','s4', 's5'] * 2]
mi_index = pd.MultiIndex.from_arrays(arraylist)
print(mi_index.levels)

DatetimeIndex(['2017-09-01', '2017-09-02', '2017-09-03', '2017-09-04',
               '2017-09-05', '2017-09-06', '2017-09-07', '2017-09-08',
               '2017-09-09', '2017-09-10', '2017-09-11', '2017-09-12',
               '2017-09-13', '2017-09-14', '2017-09-15'],
              dtype='datetime64[ns]', freq='D')

DatetimeIndex(['2017-09-14', '2017-09-09'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2017-09-09', '2017-09-14'], dtype='datetime64[ns]', freq=None)

DatetimeIndex(['2017-09-10 02:00:00', '2017-09-15 02:00:00'], dtype='datetime64[ns]', freq=None)

[['classA', 'classB'], ['s1', 's2', 's3', 's4', 's5']]

In [270]:
pd.bdate_range('11-Sep-2017', '17-Sep-2017', freq='2D')

DatetimeIndex(['2017-09-11', '2017-09-13', '2017-09-15', '2017-09-17'], dtype='datetime64[ns]', freq='2D')

In [271]:
pd.period_range('11-Sep-2017', '17-Sep-2017', freq='M')

PeriodIndex(['2017-09'], dtype='period[M]', freq='M')

In [272]:
d = pd.date_range('11-Sep-2017', '17-Sep-2017', freq='2D')
print(d + pd.Timedelta('1 days 2 hours'))

DatetimeIndex(['2017-09-12 02:00:00', '2017-09-14 02:00:00',
               '2017-09-16 02:00:00', '2017-09-18 02:00:00'],
              dtype='datetime64[ns]', freq='2D')

# Data Cleaning 

Data Cleaning alludes to change of crude information to a helpful organized shape, which is utilized for further examination. 

The procedure incorporates different ways like managing missing fields, removing duplicates etc.

- Remove **duplicate** records
  `d = d.drop_duplicates()`
  
- **Missing** Values
  - **Find** missing values
  `d['col_name'].isnull().value_counts()`
  
  - **Remove** all rows with missing values
  `d = d.dropna(how='any')`
  
  - **Replace** missing data
  `d = d.fillna(0)
    d  =  d.fillna(method='pad')
    d  =  d.fillna(df.mean())`
  
- **Extract** data from a existing column and put into a new column (use regular expression to copy first word)
 `df['new_col_name'] = df['existing_col_name'].str.extract('\W+')`
 
- **Replace** data
`df['existing_col_name'] = df['existing_col_name'].str.replace('^Abhi', 'Joyee')`

- **Filter** specific rows
`df[df['col_name'] == 'somevalue']`

**Summary Data Cleaning **


1. Set height and weight values of student s3 to NaN in the data frame df_A
2. Also set the weight of s5 to NaN in df_A.
3. Drop the rows having null values in any of the columns and assign the result to df_drop.
4. Display df_drop index.

In [280]:
print(df_A, end='\n\n\n')

#1
df_A.loc['s3', 'heights'] = np.nan
df_A.loc['s3', 'weights'] = np.nan

#2
df_A.loc['s5', 'weights'] = np.nan

#3
print(df_A, end='\n\n\n')

df_drop = df_A.dropna(how='any')

print(df_drop, end='\n\n\n')

#4
df_drop.index

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3      NaN      NaN
s4    156.2     80.4
s5    161.4      NaN


    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3      NaN      NaN
s4    156.2     80.4
s5    161.4      NaN


    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s4    156.2     80.4

Index(['s1', 's2', 's4'], dtype='object')

# Data Aggregation

Data aggregation is useful when you want to group some data together based on certain condition.

You can create such group and make a comparative study.

- **Filtering examples:-**

In [294]:
file = ur.urlopen(ur.Request("https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"))

data = pd.read_csv(file, sep = ',' , skiprows=1, decimal= '.', names = ['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'target'])

print(type(data))

print ("Total Count")
print(data['target'].count())

print('setoa count')
setoa = data[data['target'] == 'setosa'] 
print(setoa['target'].count())


print(setoa['petal_length'].min())
print(setoa['petal_length'].median())
print(setoa['petal_length'].mode())
print(setoa['petal_length'].std())

<class 'pandas.core.frame.DataFrame'>
Total Count
150
setoa count
50
1.0
1.5
0    1.5
dtype: float64
0.17351115943644546

- ** Transforming examples**

In [300]:
df_bef = pd.DataFrame({'temp':pd.Series(28 + 10*np.random.randn(10)),

                   'rain':pd.Series(100 + 50*np.random.randn(10)),

                   'location':list('AAAAABBBBB')

})

print('Before replacements')
print(df_bef, end = '\n\n')

# define replacement dictionary
replacements = {

'location': {'A':'Hyderabad', 'B':'Mumbai'}

}

df_rpl = df_bef.replace(replacements, regex=True)

print(df_rpl, end = '\n\n')


#you can also use replacement based on specific pattern

mumbai_replacements = df_rpl.loc[df_rpl.location.str.contains('umb'),:]
print(mumbai_replacements)

Before replacements
  location        rain       temp
0        A  179.035015  24.290825
1        A   62.330989   8.826666
2        A  160.319149  41.372031
3        A  122.221123  24.284912
4        A   93.507095  35.588372
5        B   37.475891  43.875394
6        B   41.924148  38.812833
7        B  137.384990  31.654383
8        B   93.190330  24.317773
9        B   31.670485   7.617140

    location        rain       temp
0  Hyderabad  179.035015  24.290825
1  Hyderabad   62.330989   8.826666
2  Hyderabad  160.319149  41.372031
3  Hyderabad  122.221123  24.284912
4  Hyderabad   93.507095  35.588372
5     Mumbai   37.475891  43.875394
6     Mumbai   41.924148  38.812833
7     Mumbai  137.384990  31.654383
8     Mumbai   93.190330  24.317773
9     Mumbai   31.670485   7.617140

  location        rain       temp
5   Mumbai   37.475891  43.875394
6   Mumbai   41.924148  38.812833
7   Mumbai  137.384990  31.654383
8   Mumbai   93.190330  24.317773
9   Mumbai   31.670485   7.617140

- ** Grouping examples**

In [339]:
regions = df_rpl.groupby('location')

print(regions.mean())

                 rain       temp
location
Hyderabad  123.482674  26.872561
Mumbai      68.329169  29.255504

**Data Grouping summary**

1. Filter the rows from df_A, whose Student_height > 160.0 and Student_weight < 80.0 and display the filtered rows.
2. Filter the rows from df_A, whose index values end with 5 and display them.
3. Create a new column Gender in data frame df_A using the below command.
     `df_A['Gender'] = ['M', 'F', 'M', 'M', 'F']``
     
4. Group df_A based on Gender and calculated mean height and weight of each group.
5. Print the column 0th and 1st column using lambda() from df_A

In [361]:
#1
print(df_A, end ='\n\n')
df_st = df_A[(df_A['heights'] > 160) & (df_st['weights'] > 80)]
print(df_st,  end ='\n\n')

#2
#print(df_A.index.)


#3
df_A['Gender'] = ['M', 'F', 'M', 'M', 'F']
print(df_A,  end ='\n\n')


#4
genders = df_A.groupby('Gender')
print(genders.mean(),  end ='\n\n')

#5
print(df_A.iloc[:, lambda x : [0,1]],  end ='\n\n')

#print(df_ind,  end ='\n\n')

    heights  weights Gender
s1    176.2     85.1      M
s2    158.4     90.2      F
s3      NaN      NaN      M
s4    156.2     80.4      M
s5    161.4      NaN      F

    heights  weights Gender
s1    176.2     85.1      M

    heights  weights Gender
s1    176.2     85.1      M
s2    158.4     90.2      F
s3      NaN      NaN      M
s4    156.2     80.4      M
s5    161.4      NaN      F

        heights  weights
Gender
F         159.9    90.20
M         166.2    82.75

    heights  weights
s1    176.2     85.1
s2    158.4     90.2
s3      NaN      NaN
s4    156.2     80.4
s5    161.4      NaN